---
kind: property
id: P:Autodesk.Revit.DB.Events.WorksharedOperationProgressChangedEventArgs.Status
source: html/eb9b8675-b0c9-38bc-038d-beac4983aaaa.htm
---
# Autodesk.Revit.DB.Events.WorksharedOperationProgressChangedEventArgs.Status Property

Gets API event status, reflect current operation execution status.

## Syntax (C#)
```csharp
public RevitAPIEventStatus Status { get; }
```